cat_shelter_backend/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "sex", "age", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Todo"], ["sex", "F"], ["age", "10"], ["description", "Check up"], ["status", "available"], ["created_at", "2020-01-18 17:16:25.854150"], ["updated_at", "2020-01-18 17:16:25.854150"]]
---
    def create
     @cat = Cat.create(cat_params)

UPDATE "cats" SET "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["description", "happy"], ["updated_at", "2020-01-21 16:50:21.330669"], ["id", 29]]
---
    def update
     @cat.update(cat_params)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 14]]
---
    def destroy
     cat = Cat.find_by(id: params[:id])
     cat.destroy

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_cat
     @cat = Cat.find(params[:id])