cat_shelter_backend/app/controllers/events_controller.rb

    def index
        @events = Event.all.order('updated_at DESC')
---
SELECT "events".* FROM "events" ORDER BY updated_at DESC

    def create
        @event = Event.create(event_params)
---
INSERT INTO "events" ("title", "description", "cat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Dental visit"], ["description", "cleaning"], ["cat_id", 6], ["created_at", "2020-01-18 17:18:01.646943"], ["updated_at", "2020-01-18 17:18:01.646943"]]

    def update
        @event.update(event_params)
---
UPDATE "events" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "vet visit"], ["description", "allergy shot"], ["updated_at", "2020-01-23 17:57:10.105350"], ["id", 20]]

    def destroy
        event = Event.find_by(id: params[:id])
        event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]

    def find_event
        @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]